# [作業目標]
- 利用範例的創建方式, 創建一組資料, 並練習如何取出最大值

# [作業重點]
- 練習創立 DataFrame (In[2])
- 如何取出口數最多的國家 (In[3], Out[3])

## 練習時間
在小量的資料上，我們用眼睛就可以看得出來程式碼是否有跑出我們理想中的結果

請嘗試想像一個你需要的資料結構 (裡面的值可以是隨機的)，然後用上述的方法把它變成 pandas DataFrame

#### Ex: 想像一個 dataframe 有兩個欄位，一個是國家，一個是人口，求人口數最多的國家

### Hints: [隨機產生數值](https://blog.csdn.net/christianashannon/article/details/78867204)

In [25]:
import pandas as pd
import numpy as np

In [26]:
data = {'國家': ,
        '人口': }
data = pd.DataFrame()

SyntaxError: invalid syntax (3594515620.py, line 1)

In [ ]:
data = [{'國家': 'tw','人口': 10}]
data = pd.DataFrame(data)

In [27]:
data

  country  population    C
0      TW         673  673
1      US         841  841
2      UK         167  167
3      JP         123  123
4      KR         982  982
5      BR         830  830
6      CN         556  556
7      CU          35   35
8      DK         321  321
9      EG         122  122

In [28]:
countries = ['TW', 'US', 'UK', 'JP', 'KR', 'BR', 'CN', 'CU', 'DK', 'EG']
population = np.random.randint(1000,size=10).tolist()
data = list(zip(countries, population))
data

[('TW', 539),
 ('US', 337),
 ('UK', 784),
 ('JP', 147),
 ('KR', 961),
 ('BR', 369),
 ('CN', 676),
 ('CU', 322),
 ('DK', 49),
 ('EG', 934)]

In [29]:
data = pd.DataFrame(data, columns=['country', 'population'])
data

  country  population
0      TW         539
1      US         337
2      UK         784
3      JP         147
4      KR         961
5      BR         369
6      CN         676
7      CU         322
8      DK          49
9      EG         934

In [40]:
maxidx = data[['population']].idxmax()
data.iloc[maxidx]['country']

4    KR
Name: country, dtype: object